{"keys":[{"path":["title"],"id":"title","weight":1,"src":"title","getFn":null},{"path":["body"],"id":"body","weight":1,"src":"body","getFn":null}],"records":[{"i":0,"$":{"0":{"v":"This page has not yet sprouted","n":0.408},"1":{"v":"[Dendron](https://dendron.so/) (the tool used to generate this site) lets authors selective publish content. You will see this page whenever you click on a link to an unpublished page\n\n![](https://foundation-prod-assetspublic53c57cce-8cpvgjldwysl.s3-us-west-2.amazonaws.com/assets/images/not-sprouted.png)","n":0.189}}},{"i":1,"$":{"0":{"v":"Writing","n":1}}},{"i":2,"$":{"0":{"v":"Nighttime Rituals","n":0.707},"1":{"v":"\n### 2:30 AM, Dec. 14 2022\n\nIt’s my shift and I cannot sleep  \nmy daughter rests peacefully beside me,  \ncovered by a warm flannel shirt,  \nmoments ago wrapped round us both,  \nthe rest of the world must wait  \n  \nWe take turns  \nAt 7, mom puts her to bed.  \nThen to 4AM its my duty to wake with her,  \nand soothe her back to sleep  \nusually, I get an hour or two of rest between!  \nUsually. Not tonight, but usually.  \n  \nwell before dawn she’ll be hungry  \nmy tools’re smote to ash in my hands  \nin comes the cavalry (mom) for breakfast,  \nwhile I rest for a few uninterrupted hours,  \nin the other room.  \n  \nthen, breakfast,  \nthen, work,  \nthen, bathtime,  \nthere and back again.  \n  \nP.S. I did the dishes while insomnia did me in.\n","n":0.086}}},{"i":3,"$":{"0":{"v":"Frank","n":1},"1":{"v":"\nEvery morning i get up, i start doing the dishes until frank wakes up and ambles into the kitchen. he's always been old, we got him ~5 years ago, in february 2020. he was picked up off the streets and spent a few months in the shelter before we got him as a senior rescue. they told us he was somewhere between 8-12. pit bulls dont live long lives - whatever his actual age is, hes a senior citizen now.\n\nanyways, frank usually sleeps in. lately ive been having to go rouse him, so we can go for our morning constitutional. sometime's my daughter joins us, but not always. he's not steady on his feet anymore, so i have to be careful not to knock him over while he's on his feet. when my daughter comes, i put two leashes on, so she can hold one and practice walking him. it's a big responsibility for a 2 year old, but she's getting the hang of it. frank can't manage stairs anymore, and we live on the 2nd story of a walkup, so i carry all 60 pounds of him down the stairs, and when we get back, i carry him back up.\n\nwe have hardwood floors, and sometimes he has trouble getting up, because of his arthritis, so i try to keep my ears peeled, listening for him scrabbling on the floor.\n\nhe doesn't like other dogs, and i think a lot about how stressful his time at the shelter must have been. the shelter housed a lot of dogs, and he was isolated into his own area, but they were still right on the other side of the divider, barking and making noise. he's on a lot of medications for his arthritis, but when we got him he was also on a LOT of trazadone, an anti-anxiety medication. he also had, at the time, severe separation anxiety. he's gotten a lot better, but at our previous apartments, if we left him for more than 10 or 15 minutes, he would all but lose his mind. in oakland, during covid, he chewed up the trim on the front door. after that, we rearranged a lot of our schedule to ensure he was never alone. funnily enough, he is fine in the car - when we first got him, he would spend hours with his head out the window. his arthritis prevents that now, but we leave the windows down so he can crane his neck up and catch the breeze. so we learned to do lots of road trips, and go out to eat in the evenings, so the car wouldn't bake in the sun. whenever we got back to the car, even now in his advanced age, he somehow manages to climb into the driver's seat, usually curled up but sometimes sitting at attention, waiting for our return. when we moved to chicago, we tried again and left him in one of the bedrooms, so if he chewed stuff up, it would just be in that one room. he tore the closet door off the hinges, and it got wedged between the door and the dresser. i only barely managed to squeeze in and move it. again, we stopped doing that for a while. i realized, after that, it was the feeling of being locked *in a room* that triggered him. i leave the doors open where we live now. he's never chewed anything up here.\n\nstill, at night, if my wife and i shut the door to our bedroom, i can hear him pacing up and down the hallway, looking for us.\n\nhe never barks or growls, except at other dogs. ive learned how he talks though. he needs help getting up on the couch - he used to be able to clamber up on his own, but not anymore. he walks up to the couch, pointing at it, and peers at me sideways. as soon as i wrap my arms around his chest, he lifts his front paws up and hoists himself up with my assistance.\n\nlately, i've had to wake him up for his afternoon constitutional/bathroom break. if he could, he'd sleep till dinner time. he used to be able to play, but age has taken that from him too. everyone who met him 2-3 years ago would be shocked at how methodically he would tear apart his ropes. it was surgical precision, really. he also once loved to play tug of war. at first, he would endlessly tug and tug until he was tired, but still hold fast onto the rope, insisting you to try to take it from him. when he stopped trying to wrest it from you, he'd still stubbornly hold fast while you tried to pull it from his jaws. he can't do that anymore, he has no balance. still, sometimes, usually when company is over, he will search for one of his ropes, pull it out of the basket, and present it to someone, requesting a game. he'll still try and play, but if you tug, he just falls over. i always get the sense in that moment that he's a little dejected or embarrased, like he knows he can't play like he used to.\n\nfrank will always be a california boy. in winter, when the snow flies and the sidewalks are covered in ice, he hates to go outside. it's not so bad in chicago, where it usually isn't below freezing, but in the few weeks where its *frigid*, his paws get cold. he'll gamely walk a few steps, then lift a paw and limp on bravely, and then lay down. i have to carry him back inside.\n\ni work from home, and most of the day he sits curled up at my feet below my desk.\n\nwhen we first met frank at the shelter, i had been arguing for months about getting a dog. i grew up with dogs around. at my grandma's farmhouse, for all the first years of my life, there was a shorthair husky named Hannah. She was one of the sweetest dogs ive ever met, and she has been the yardstick by which i judge all other canines. When I was 7, they found a puppy sequested in the boy scout shelter on the edge of town - bear in mind, this was in the middle of a central wisconsin winter. He was only a few months old, and when they found him, his bowl of water had been frozen over. It wasn't neglect, just an instance of youthful indiscretion - someone had adopted this puppy without telling their parents, and their parents refused to take him in. The adopter couldn't find a place to keep him, so they put the puppy in this shelter. he ended up in the humane society shelter in the next town over, and my parents took me to meet him. we, of course, fell in love and took him home. His name was 'Socks', but that wasn't a very fitting name. My dad wanted to name him 'Ike', after Eisenhower, but my mom refused. We named him 'Sherman'. He looked like a Rhodesian ridgeback, except for the titular ridge. Sherman's mom was an aussie shepherd, and the father was a coon hound. The mom was a farm dog that got knocked up by a neighbnor's dog, a tale as old as time. Anyways, that was my 'first dog' officially, although i feel like Hannah was that in all but name.\n\nfrank had spent 3 months in the shelter when we met him. my wife wanted a small dog - she had never had a dog before, her sister adopted a mutt after Sri Lanka was hit in a tsunami in 2010, but my wife was 'too busy chasing boys' according to her story and she never really imprinted on pinky until after frank. we went to the shelter to meet a bunch of senior fellows, all of them small. frank's cloister was sort of the vestibule of the operation - the other dogs were all in other areas, but to get to them, you had to go through this vestibule. between meeting Shrimp & Grits, a pair of dachshunds, and Moneypenny, an aussie on hospice, we ran into frank. the first moment you crossed into his domain, it was clear how gentle his soul was. he wanted to play with someone so badly, he grabbed his whole bed and hoisted it towards me like it was a toy. we spent a little bit of time with him, and despite his size, he was so gentle. later on, when we lived with my parents for a few months, between moving from oakland and moving to chicago, i would play with him in my parents garage - we would move the cars out and i would swing a rope toy around for him to chase. sometimes, frank would be on the other end of the toy as i swung. once, during this kind of play, he leapt for the rope but misjudged, and wrapped his jaws around my arm. he didn't bite down, didn't hurt me at all, and let go immediately (& sheepishly). before then, i knew his gentleness, but that confirmed it.\n\nwe went to spend some time with moneypenny after meeting frank in his vestibule. moneypenny was sweet, but she was sick that day, and it felt like she was really on her last legs. i hope the end of her life was peaceful, but this isn't her story. we took frank on a walk around the block. he doesn't do this anymore, but for the first few years, whenever we took him on a walk, he would carry his rope with him. whenever he saw a dog, he would chomp on it like a horse chomping a bit. it was like a security blanket, and he never left home without it, until he did, when the ropes started to get too tough for his teeth. we left the shelter that day without a dog, and a decision to make. my wife didn't admit it then, but her heart was set on frank - she was just afraid because he was 'big'. she left for a trip a few weeks later, and told me that when she came back, either frank was at our house or not, which was as close as she could get to saying 'yes' without saying yes.\n\nof course, i went and picked him up. the rest is history, mostly. he's a good boy, and im grateful for the time i've had with him, and whatever time ive still got.\n\nill carry him up and down the stairs as long as im able, and as long as he's willing. i think thats what love looks like.\n\n2024-12-15: im glad i got one more walk with him today.\n","n":0.024}}},{"i":4,"$":{"0":{"v":"Astro Poems","n":0.707},"1":{"v":"\n\nAquarius bears draughts of Heaven’s endless flows. His cup upturneth to lay the earth’s thirst low. Placed among the stars is Phrygia’s handsomest youth, that beloved servant of Jove. By his hand alone courses what is above into its below.\n\nAries first mantled in Golden fleece, commands the Sun’s descent to cease; In a grove of Mars its pelt was brought, there shines the Dawn Proclaimer, whom Argo sought; the Ram, impatient sacrifice, That Which Knows; which saved Isaac in the Sacred Grove.\n\nCancer dimly in the skies alights. Its watery chambers saw dawn’s first light. No match for Hercules was this pincered foe, yet in its claws the Sun’s ascent froze. Lunar champion and Hera’s aide, against it’s influence begin solar rays to fade.\n\nCapricorn’s, from depths inspired; By thy domain the Arts are conspired; By thee the Miners burn the Womb of Earth; And see the place of Metal’s fatal birth; By thee they melt; by thee they work the Mould, Refine, and Stamp it into mighty Gold.\n\nGemini twins atop Heaven mount. And they o’er gates of hell stand guard. They are Castor and Pollux, keepers of St. Elmo’s fire. United in will and with fates entwined, so does their wit reign o’er their Nature and refine.\n\nLeo, rampart of the lion’s whelp — Judah. He who received the praise of his brethren: whose hand was in the neck of his enemies; his father’s children bowed before him. The sceptre did not depart from Judah, nor a lawgiver from between his feet, until Shiloh’s arrival; and unto him was the gathering of his people.\n\nLibra’s scales, upon which poize Night and Day; in hand Justice weigh’d her Balance. Only she knoweth what guard the Good; Only she knoweth what the Guilty owe; Only she Judgeth their Fate.\n\nPisces, doubled in shining scale, from the Underworld ascend; They know the Coasts, the Winds, the Ports, and Shores; may turn the Helm, or ply the bending Oars; As they direct, ne’er lost the Tide, retain mastery o’er the gulfs wide.\n\nSagittarius, the Archer, mantle of Krotos, son of Eupheme, nurse of the Muses. Behold he hath carried his bow unto the stars. And behold Zeus hath rendered unto him a horse’s flank, for his fleetness of foot. And behold Zeus hath rendered unto him a Satyr’s tail, for his zeal unto the Muses. And behold a wreath at his feet, as befits the Son of Pan.\n\nScorpio who with slew with poison boastful Orion. “There is no wild beast,” spoke he, “which I cannot master.” Wrothful Gaia sent forth her pincered champion, for justice accrued: the life of Orion’s ward, Artemis was due. Her guardian, Orion, in her defense rose; he against its pincers ne’er found repose; beneath its poison his last breath deposed. For their daring, by Jove’s hand eachs ascends; in eternal rivalry they the astral plains still rend.\n\nTaurus slowmoving laid temple foundations to lastt.With limbs of weighty iron and reserved aspiring minds, it’s oxen shoulders hold heavy burdens steadfast. That Golden calf yet carries forth from heaven’s depths, brighter skies o’er these earthly steppes.\n\nVirgo’s gentle rays do polish hearts, in man’s breast they injustice thwart, With words honey’d smooth, and rhetoric strong, they rule and are e’en monarchs by their tongue. Mother Mary’s paeans heard far above, from her lips modest praise proclaim’d soft.\n","n":0.043}}},{"i":5,"$":{"0":{"v":"American Dreamtime","n":0.707},"1":{"v":"\nthe american dream is baby blue wallpaper  \nand daytime television  \nit’s a child translating between an immigration clerk  \nand their mother  \n","n":0.213}}},{"i":6,"$":{"0":{"v":"A Journey","n":0.707},"1":{"v":"two men, a muslim and a jew, set out on foot  \nfrom neighbouring towns, on a pilgrimage to jerusalem  \nthey meet upon the road, and agree to share in the journey.  \n  \nwhen the Khamsin blows, they choke the same dust  \nwhen a spring is found, they drink the same waters  \nin the evening twilight, they break their bread  \nand share stories of their youth over firelight.  \n  \nthey arrive in jerusalem, and go their separate ways  \nthe muslim meets another one of his people  \nthis other also comes to the holy city on pilgrimage  \nheld aloft on a palanquin, floating over the road  \nhis feet never touched the road.  \n  \nwho is the compatriot of the one who originally set out on the road?\n","n":0.089}}},{"i":7,"$":{"0":{"v":"Projects","n":1}}},{"i":8,"$":{"0":{"v":"Software","n":1},"1":{"v":"\nA collection of software projects I've worked on.\n","n":0.354}}},{"i":9,"$":{"0":{"v":"Packmule","n":1},"1":{"v":"## Packmule Boulangerie ([Source Code](https://github.com/helle253/packmule))\n\nA rails app I put together for a buddy of mine. It is not currently live, unfortunately.\n\nThe most interesting part was implementing a client-side js rendering tool for taking a `.glb` file and outputting a nice GIF where the scene rotates endlessly. The intention was to be able to upload this and allow the content managers to upload a GIF every week for whatever the new boulangerie box was! You Cacan find the source code [here](https://github.com/helle253/packmule/blob/main/app/javascript/controllers/dashboard_controller.js). I wasn't satisfied with the existing solutions for consuming a scene description and returning a simple .gif. Cloudinary has [something](https://cloudinary.com/documentation/transformations_on_3d_models) like what I was looking for, but it did not support the minimum frame rates I was looking for.\n\nCCapture.js allowed me to preserve a constant frame-rate during the recording process. User inputs the .glb, hits record, and the client-side browser spits something nice back out.\n\nI wanted to add some primitive controls (view-angle, distance, rotation speed, duration, etc.) but working with Javascript from within Rails is pretty onerous, and the MVP got the job done.\n\n![Example Viewport](assets/packmule.gif)\n\nThe cursor is missing in this snippet, but hovering over one of the cards would pause the rotation!\n\nThe rest of the app is fully functional, albeit sparing. Users can sign up and sign up for food-boxes. Admins can sign in, manage users, record notes about them (for recording delivery instructions), and upload media (with the intention of showcasing previous boxes).\n\nIt was an enjoyable experience building this, the folks I built it for were and are super collaborative partners. It required iteration and a ton of conversations honing in on what the goals were, and I'm proud of the finished product.\n","n":0.06}}},{"i":10,"$":{"0":{"v":"Face Scanner","n":0.707},"1":{"v":"## Flutter Face Scanner iOS App ([Source Code](https://github.com/helle253/face-scanner))\n\nA little proof of concept app I whipped up as a PoC for a friend.\n\nIt took a little bit of wrangling, because the plugin I was hoping to rely on didn't actually provide the data I needed (vertices) in order to render the user's face as a mesh and share that via the native share sheet widget.\n\nWas fun! I try to avoid working with Swift/Objective C because I'm not a fan of XCode. (I like Flutter better, but I'm not entirely confident support for it won't be axed at any given second. RIP Google Domains...)\n","n":0.099}}},{"i":11,"$":{"0":{"v":"Dendron","n":1},"1":{"v":"Dendron uses Antd for its component styling.\n\nIn order to create a custom style, we gotta override the theme. Antd's v5 release drops .less support in favor of tokens, but Dendron wants a css file. [You can use this npm package](https://www.npmjs.com/package/@emeks/antd-custom-theme-generator) to generate an antd-friendly css file.\n\n[References Antd less variable source](https://github.com/ant-design/ant-design/blob/80110b54242552f78eaa93b818d4dd0cbed65f89/components/style/themes/default.less#L31) - these variables are what you can/should use to update the theming.\n\nGetting the CSS right has been a little fiddly, but I've learned some useful (albeit cursed) things about css selectors and psuedoclasses. [the .less file I had to fiddle with](https://github.com/helle253/notes/blob/main/assets/theme.less)\n","n":0.105}}},{"i":12,"$":{"0":{"v":"Agorascope","n":1},"1":{"v":"\n## Falkland Islands War\n\nI'm going to limit this to a partial list of British Entities, for simplicity's sake.\n\n### Places\n\n(are these administrative_areas, or are they states? They're overseas territories, so technically not state/province level.)\n\nHow is 'ownership' represented in schema.org? It seems like it kind of doesn't exist.\n\n[Falkland_Islands](https://en.wikipedia.org/wiki/Falkland_Islands) - [Schema](https://schema.org/AdministrativeArea)\n\n[South_Georgia_and_the_South_Sandwich_Islands](https://en.wikipedia.org/wiki/South_Georgia_and_the_South_Sandwich_Islands) - [Schema]([Schema](https://schema.org/AdministrativeArea))\n\n[United_Kingdom](https://en.wikipedia.org/wiki/United_Kingdom) - [Schema](https://schema.org/Country)\n\n### Organizations\n\n[United_Kingdom](https://en.wikipedia.org/wiki/United_Kingdom) - [Schema](https://schema.org/GovernmentOrganization)\n\n[Royal_Navy](https://en.wikipedia.org/wiki/Royal_Navy) - [Schema](https://schema.org/GovernmentOrganization)\n\n### British Naval Forces\n\n#### Centaur Class Carrier\n\n[HMS_Invincible_(R05)](https://en.wikipedia.org/wiki/HMS_Invincible_(R05))\n\n##### Centaur Class Ships\n\n[HMS_Hermes_(R12)](https://en.wikipedia.org/wiki/HMS_Hermes_(R12)) - [Schema](https://schema.org/Vehicle)\n\n#### Invincible Class Carrier\n\n[HMS_Invincible_(R05)](https://en.wikipedia.org/wiki/HMS_Invincible_(R05))\n\n##### Invincible Class Ships\n\n[HMS_Invincible_(R05)](https://en.wikipedia.org/wiki/HMS_Invincible_(R05)) - [Schema](https://schema.org/Vehicle)\n\n#### Fearless Class LPD\n\n[Fearless-class_landing_platform_dock](https://en.wikipedia.org/wiki/Fearless-class_landing_platform_dock)\n\n##### Fearless Class Ships\n\n[HMS_Fearless_(L10)](https://en.wikipedia.org/wiki/HMS_Fearless_(L10)) - [Schema](https://schema.org/Vehicle)\n\n[HMS_Intrepid_(L11)](https://en.wikipedia.org/wiki/HMS_Intrepid_(L11)) - [Schema](https://schema.org/Vehicle)\n\n#### Type 82 Destroyer\n\n[Type_82_destroyer](https://en.wikipedia.org/wiki/Type_82_destroyer)\n\n##### Type 82 Destroyer Ships\n\n[HMS_Bristol_(D23)](https://en.wikipedia.org/wiki/HMS_Bristol_(D23)) - [Schema](https://schema.org/Vehicle)\n\n#### Type 42 Destroyer\n\n[Type_42_destroyer](https://en.wikipedia.org/wiki/Type_42_destroyer)\n\n##### Type 42 Destroyer Ships\n\n[HMS_Sheffield_(D80)](https://en.wikipedia.org/wiki/HMS_Sheffield_(D80)) - [Schema](https://schema.org/Vehicle)\n\n[HMS_Coventry_(D118)](https://en.wikipedia.org/wiki/HMS_Coventry_(D118)) - [Schema](https://schema.org/Vehicle)\n\n[HMS_Glasgow_(D88)](https://en.wikipedia.org/wiki/HMS_Glasgow_(D88)) - [Schema](https://schema.org/Vehicle)\n\n[HMS_Cardiff_(D108)](https://en.wikipedia.org/wiki/HMS_Cardiff_(D108)) - [Schema](https://schema.org/Vehicle)\n\n[HMS_Exeter_(D89)](https://en.wikipedia.org/wiki/HMS_Exeter_(D89)) - [Schema](https://schema.org/Vehicle)\n\n### Events\n\n[Operation Paraquet](https://en.wikipedia.org/wiki/Operation_Paraquet) - [Schema](https://schema.org/Event)\n\n[Operation Black Buck](https://en.wikipedia.org/wiki/Operation_Black_Buck) - [Schema](https://schema.org/EventSeries)\n\nOperation Black Buck is actually a series of 7 operations, so it's not a single event. This seems like an interesting schema model to consider.\n\n[Bluff Cove Air Attacks](https://en.wikipedia.org/wiki/Bluff_Cove_air_attacks) - [Schema](https://schema.org/Event)\n","n":0.082}}},{"i":13,"$":{"0":{"v":"Astro Cards","n":0.707},"1":{"v":"![Postcard](assets/postcard-pisces.png)\n\nI am collector and sender of postcards and this was a small project undertaken to create a series of 12 postcards, each themed off the traditional zodiac symbols. The intention is to provide a canvas to showcase Dr. John Bevis's [Uranographia Britannica (ca. 1749)](https://publicdomainreview.org/collection/bevis-uranographia) on the front side (I'm a huge fan of the public domain!).\n\nTo this end, I drafted a series of 12 small poems. You can see in the image above the desired format - it was an interesting challenge to work within the constraints of the form. You can find them [here]([writing.creative.astro-poems)]. I leaned heavily on Marcus Manilius's Astronomica, as translated by Thomas Creech (1659-1700) - as well as referring to a fair amount of anglo poetry from the early modern era. Also, a lot of old assyriologists/egyptologists from the late 19th/early 20th century. I have the full list of references on a hard drive somewhere, I hope to get around to recovering them one day.\n\nBaskerville was an intuitive choice of typeface, being a product of the era I intended to emulate. I'm sure others exist, but Baskerville is popular and readily available for use.\n![Baskerville](assets/baskerville.png)\n\nThese would be a useful tool for anyone interested in chart-drawing. There is enough space to briefly elucidate the chart, but the space for the chart itself is not too small so as to be cramped. I was not satisfied with the finish on the first batch and one day will revisit.\n","n":0.065}}},{"i":14,"$":{"0":{"v":"Books","n":1}}},{"i":15,"$":{"0":{"v":"The History of the Devil","n":0.447},"1":{"v":"\n[the-history-of-the-devil.pdf](assets/the-history-of-the-devil.pdf)\n\nFlusser has an economy with words that is really impressive tbh.\n","n":0.302}}},{"i":16,"$":{"0":{"v":"Strategy without Design","n":0.577},"1":{"v":"\n[strategy-without-design.pdf](assets/strategy-without-design.pdf)\n","n":1}}},{"i":17,"$":{"0":{"v":"Sand County Almanac","n":0.577},"1":{"v":"\n![Sand County Almanac Cover](assets/sand-county-almanac.png)\n\n[Sand County Almanac PDF](assets/sand-county-almanac.pdf)\n","n":0.378}}},{"i":18,"$":{"0":{"v":"Fossil Legends of the First Americans","n":0.408},"1":{"v":"\n\nWoah, Ben Franklin was a noted paleontologist??? Interesting how many famous seminal Americans were ALSO avid dinosaur guys.\n\nIt would be hard not to be, given how many artifacts seemed to just be.... nakedly visible across the land (and who amongst them would guess their ancientness???)\n","n":0.149}}},{"i":19,"$":{"0":{"v":"A Peoples Tragedy the Russian Revolution","n":0.408},"1":{"v":"\nA notable failure of the provisional government (maybe a common failure mode for centrist govts?) was Karensky's lack of appeal as a leader, especially in comparison to the charismatic Lenin.\n\nThe bungled Kornilov affair torpedoed his popularity, also. Combined with Kerensky's 'no enemies on the left' policy, he left his flank wide open for the Bolsheviks to consolidate power.\n\n6/23/23 - the failed Kornilov putch v2. Wagner turning around and heading towards Moscow seems... ?\n\nI am not sure how much paralellism you want to draw between Putin and Karensky, and the current Russian regime and the provisional government. It feels like there is only a passing resemblance.\n","n":0.098}}},{"i":20,"$":{"0":{"v":"Misc","n":1}}},{"i":21,"$":{"0":{"v":"Midwest Geography","n":0.707},"1":{"v":"\nOhio: Iqoquosi, 'great river'\n\nMinnesota: Dakota, 'sky-tinted water'\n\nIllinois: Algonquin, 'tribe of great men'\n\nWisconsin: Algonquin, meaning unknown. Possibly derives from ᒣᔅᑯᐤᓯᣙ (meskowsin) misspelled as Meskousing, frenchified into Ouisconsin. Anglicized, Wisconsin.\n","n":0.189}}},{"i":22,"$":{"0":{"v":"Energy Drinks","n":0.707},"1":{"v":"![M-150](assets/m-150.png)\nM150 Can - Thai - 4/10 - sugar rush in a can, tastes good but has the caffeine of a cup of tea\n\nM150 Bottle - Thai - 5/10 - same as the can, i just like glass bottles more\n\n![Guarana Original](assets/guarana-original.png)\nGuarana Original - Serbian - 5/10 tastes like sour apple masking chemicals\n\n![Alokozay](assets/alokozay.png)\nAlokozay Energy - Dubai - 3/10 tastes like chemicals\n\n![Ginseng Energy](assets/ginseng-energy.png)\nGinseng Energy - Korean - 9/10 - Tasted like pear juice.\n\n![Carabao Energy Drink](assets/carabao.png)\nCarabao - Thai - 4/10 - Sugar rush in a can, I think its the exact same stuff as the M150 in a different can.\n\n![Bing Blu](assets/bing-blu.png)\nBing Blu - 10/10 - No notes, love blue raspberry.\n\n![Bing Crisp](assets/bing-crisp.png)\nBing Crisp - 9/10 - Tastes like a sour apple ('crisp' is accurate)\n\n![Bing Cherry](assets/bing-cherry.png)\nBing Cherry - 7/10 - i dont like cherries all that mucch :(\n\n![Bing Black](assets/bing-black.png)\nBing Black - 10/10 - surprised by this one, Blackberries are underrated.\n\n![G Fuel Sonic](assets/gfuel-sonic.jpg)\nG Fuel Sonic - 7.5/10 - Knockoff peach Monster\n\n![Prime](assets/prime.jpg)\nPrime -  9/10 - Tastes like those popsicles. Banned in Canada.\n\n![Wired 344 Sugar Free](assets/wired-344-sugar-free.jpg)\nWired 344 Sugar Free - 7/10 - Drank this and forgot time existed. Chemical aftertastes.\n\n![M-Power](assets/m-power.jpeg)\nM-Power - Polish - 4/10 - Sugary\n\n![Golden Eagle](assets/golden-eagle.png)\nGolden Eagle - Kosovan - 7/10 - it was alright.\n\n![Monster Energy White Pineapple](assets/monster-energy-white-pineapple.png)\nMonster Energy White Pineapple - 10/10 - really good.\n\n![Bucked Up Miami](assets/bucked-up-miami.png)\nBucked Up Miami - 7/10\n\n![Aussie Lemonade](assets/aussie-lemonade.jpg)\nAussie Lemonade - 7/10 - tastes like a Mello Yello or something.\n\n![Oreo coke](assets/oreo-coke.jpg)\nOreo Coke - 7/10 - tastes like a coke?\n\n![Iced Vanilla Berry](assets/iced-vanilla-berry.jpg)\nIced Vanilla Berry - 7.5/10 - its alright.\n\n![Girl Scouts Thin Mints](assets/girl-scouts-thin-mints.jpg)\nGirl Scouts Thin Mints - 5/10 - tastes like a thin mint (i dont like thin mints).\n\n![Red Bull Kratingdaeng](assets/thai-red-bull.jpg)\nWay too sweet - Thailand - 6/10\n\n![Red Bull Plus](assets/red-bull-plus.jpg)\nsweet but not overly cloying - Malaysia - 9/10\n\n![Ghost 'Merica Pop](assets/ghost-merica-pop.jpg)\nGhost 'Merica Pop - 7/10 - Too much cherry in the flavor profile.\n\n![Irish Moss](assets/irish-moss.png)\nIrish Moss - Jamaica - 9/10 - tastes like wet peanut butter.\n\n![Black Rifle Project Mango](assets/black-rifle-project-mango.jpg)\nBlack Rifle Project Mango - 6/10 - tastes like a mango juul pod.\n\n![Armaan's Bitter Kola](assets/armaans-bitter-kola.jpg)\nArmaan's Bitter Kola - Sierra Leone - 2/10 - tastes like elderberry syrup but worse.\n\n![Adrenaline Rush](assets/adrenaline-rush.jpg)\nAdrenaline Rush - Guatemala - 7.5/10 - tastes like orange juice.\n\n![Acassan AK-100](assets/acassan-ak-100.jpg)\nAcassan AK-100 - Haiti - 4/10 - tastes like ice cream flavored medicine.\n\n![Arizona Extreme Performance](assets/arizona-extreme-performance.jpg)\nArizona Extreme Performance - 8/10\n\n![Arizona Performance Low Carb](assets/arizona-low-carb-performance.jpg)\nArizona Extreme Performance - 8.5/10 - tastes like carbonated green tea.\n\n![Arizona Extreme Performance Fruit Punch](assets/arizona-extreme-performance-fruit-punch.jpg)\nArizona Extreme Performance Fruit Punch - 8/10\n","n":0.051}}},{"i":23,"$":{"0":{"v":"Anime","n":1},"1":{"v":"\nDumping a list of anime (and other, similar animated flicks) I like.\n\n- Trigun\n- Cowboy Bebop\n- Samurai Champloo\n- Space Dandy\n- Neon Genesis Evangelion\n- Dan Da Dan\n- FMA: Brotherhood\n- Dungeon Meshi\n- Scissor Seven\n- Devilman Crybaby\n- Castlevania\n- Vinland Saga\n- Mob Psycho 100\n- Mononoke\n- One Punch Man\n- Baccano\n- Hunter X Hunter\n- Dorohedoro\n- Ergo Proxy\n","n":0.141}}},{"i":24,"$":{"0":{"v":"Home","n":1},"1":{"v":"\nHey, my name is Nathan.\n\nI'm a programmer a Blue Bottle Coffee.\n\nMy day job involves a lot of Typescript and Ruby. I bang on the frontend, the backend, and everything in between. Owing to this, I've had a lot of exposure to just about every part of our stack - from Tailwind & UI components to our [mobile app](https://apps.apple.com/us/app/blue-bottle-coffee/id1440573734) to CDK and provisioning/managing AWS resources. To be honest, I wouldn't have it any other way. I love learning - having my fingers in every part of the software pie (frontend, backend, devops, [...]) ensures I've always got something new consider.\n\nThis website is markdown and I use [Dendron](https://www.dendron.so/) to take notes. Not much here (yet) but hopefully that will change. You can look at the source [here](https://github.com/helle253/notes).\n","n":0.089}}}]}
